# St7SetTransientInitialConditionsNodalVelocity

Sets the load case that specifies the initial nodal velocity for linear and nonlinear transient dynamic analysis. The
initial velocity components are defined by the Initial Velocity nodal attribute.

long St7SetTransientInitialConditionsNodalVelocity(long uID, long CaseNum)
Input Parameters
uID
Strand7 model file ID.
CaseNum
Load case number.